Revit 2027 API
Arc.Center Property
Returns the center of the arc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Center { get; }
Public ReadOnly Property Center As XYZ
	Get
public:
property XYZ^ Center {
	XYZ^ get ();
}
member Center : XYZ with get
Property Value
XYZ
See Also
Reference
Arc Class
Autodesk.Revit.DB Namespace